import os
import webbrowser
os.system("clear")
print("""\033[31m

██████╗  ██████╗░██████╗██╗██████╗        ██████╗██████╗ ██╗   ██╗
██╔══██╗██╔════╝██╔════╝██║██╔══██╗      ██╔════╝██╔══██╗╚██╗ ██╔╝
██████╦╝╚█████╗░╚█████╗░██║██║░░██║█████╗╚█████╗░██████╔╝ ╚████╔╝
██╔══██╗░╚═══██╗░╚═══██╗██║██║░░██║╚════╝░╚═══██╗██╔═══╝   ╚██╔╝
██████╦╝██████╔╝██████╔╝██║██████╔╝      ██████╔╝██║        ██║
╚═════╝░╚═════╝░╚═════╝░╚═╝╚═════╝       ╚═════╝░╚═╝        ╚═╝
       ░░	░░░	░			░
       ░░	░░░	░			░
       ░░		░			░
       						░      
""")

print("\033[34m[i] \033[37m- Info (Как пользоваться)  \033[31m[m]\033[37m - Пробив по MAC")
a = input("\033[31mВаш выбор: ")
if a == "m":	
	m = input("\033[32mВведите \033[34mMAC-адрес \033[32mроутера или Сетевой карты: ")
	print("""
\033[32m Данные на MAC-адрес здесь: 
https://api.mylnikov.org/geolocation/wifi?bssid=""" + m + """&data=open&v=1.1

	\033[33mlat - широта
	range - долгота
	
\033[31mВНИМАНИЕ! Если адрес введён неверно - ссылка будет недействительной.
Также не все MAC можно пробить.
Для всех подробностей перезапустите утилиту и выберите '[i]'\033[37m""")
	webbrowser.open("https://api.mylnikov.org/geolocation/wifi?bssid=" + a + "&data=open&v=1.1", new=2)
elif a == "i":
		print("""\033[37mПодробно о пробиве по MAC-Адресу читайте здесь:
\033[31mhttps://github.com/SHMAT-HACK \033[32mили \033[31mhttps://t.me/SHMAT-HACK\033[37m""")
